{
  "what are your class timings?": "Our yoga classes run Monday to Friday from 7:00 AM to 8:00 PM, and on weekends from 8:00 AM to 6:00 PM. You can see the full schedule on our website.",
  "how do i join a class?": "You can join a class by signing up on our website or by visiting the studio in person. We recommend booking in advance to secure your spot.",
  "what types of yoga do you offer?": "We offer Hatha, Vinyasa, Yin, Ashtanga, and Restorative yoga classes suitable for all levels.",
  "do i need to bring my own mat?": "We provide yoga mats at the studio, but you are welcome to bring your own if you prefer.",
  "are the classes suitable for beginners?": "Yes! We have beginner-friendly classes and instructors who guide you through every step.",
  "how much do classes cost?": "We offer single class passes, monthly memberships, and packages. Please check our pricing page for the latest details.",
  "do you offer online classes?": "Yes, we provide live online classes via Zoom. You can book them through our website.",
  "what should i wear to yoga?": "Wear comfortable, breathable clothing that allows you to move freely. Avoid jeans or restrictive clothing.",
  "do you offer private sessions?": "Yes, private yoga sessions are available. You can schedule them directly with one of our instructors.",
  "is there parking available?": "Yes, we have free parking spaces for our students near the studio.",
  "how can i contact the studio?": "You can contact us by phone, email, or through our website contact form. Our staff will be happy to assist you.",
  "what are the covid safety measures?": "We follow strict hygiene protocols, including sanitized mats, social distancing, and mask guidelines in line with local regulations.",
  "can i cancel or reschedule a class?": "Yes, you can cancel or reschedule a class up to 12 hours before the start time. Please refer to our cancellation policy for details.",
  "do you provide yoga for kids?": "Yes, we offer special yoga classes for children aged 5-12, focusing on fun, flexibility, and mindfulness.",
  "do you offer workshops or events?": "Yes, we regularly host workshops, retreats, and special events. Check our website or newsletter for upcoming events."
}
