{
  "Who are the trainers": "Our trainers are certified yoga instructors with extensive experience teaching various yoga styles. They provide guidance, ensure proper alignment, and offer personalized support for all levels.",
  "What is the difference between yoga types": "Yoga styles vary in pace, focus, and intensity. Hatha is gentle and foundational, Vinyasa flows with breath, Yin targets deep connective tissues, Ashtanga is physically challenging and structured, and Restorative emphasizes relaxation and recovery. Each type supports different goals such as strength, flexibility, mindfulness, or stress relief.",
  "What is Hatha yoga": "Hatha is a gentle, foundational yoga style focusing on basic postures, alignment, and breath control. It is ideal for beginners and those seeking a calm, mindful practice.",
  "What is Vinyasa yoga": "Vinyasa is a dynamic style where movements are synchronized with the breath. It builds strength, flexibility, and endurance while keeping the practice creative and energizing.",
  "What is Yin yoga": "Yin yoga is slow-paced and involves holding poses for longer periods to target deep connective tissues. It promotes flexibility, joint health, and mindfulness.",
  "What is Ashtanga yoga": "Ashtanga is a rigorous, structured yoga style that follows a specific sequence of poses. It develops strength, stamina, and focus, and is suited for more experienced practitioners.",
  "What is Restorative yoga": "Restorative yoga focuses on relaxation and recovery. Gentle poses are supported with props, allowing the body and mind to fully relax and rejuvenate.",
  "Do I need experience to join a class": "No prior experience is required. Classes are designed for all levels, with modifications provided as needed.",
  "What are your class timings": "Our yoga classes run Monday to Friday from 7:00 AM to 8:00 PM, and on weekends from 8:00 AM to 6:00 PM. You can see the full schedule on our website.",
  "How do I join a class": "You can join a class by signing up on our website or by visiting the studio in person. We recommend booking in advance to secure your spot.",
  "What types of yoga do you offer": "We offer Hatha, Vinyasa, Yin, Ashtanga, and Restorative yoga classes suitable for all levels.",
  "Do I need to bring my own mat": "We provide yoga mats at the studio, but you are welcome to bring your own if you prefer.",
  "Are the classes suitable for beginners": "Yes! We have beginner-friendly classes and instructors who guide you through every step.",
  "How much do classes cost": "We offer single class passes, monthly memberships, and packages. Please check our pricing page for the latest details.",
  "Do you offer online classes": "Yes, we provide live online classes via Zoom. You can book them through our website.",
  "What should I wear to yoga": "Wear comfortable, breathable clothing that allows you to move freely. Avoid jeans or restrictive clothing.",
  "Do you offer private sessions": "Yes, private yoga sessions are available. You can schedule them directly with one of our instructors.",
  "Is there parking available": "Yes, we have free parking spaces for our students near the studio.",
  "How can I contact the studio": "You can contact us by phone, email, or through our website contact form. Our staff will be happy to assist you.",
  "What are the COVID safety measures": "We follow strict hygiene protocols, including sanitized mats, social distancing, and mask guidelines in line with local regulations.",
  "Can I cancel or reschedule a class": "Yes, you can cancel or reschedule a class up to 12 hours before the start time. Please refer to our cancellation policy for details.",
  "Do you provide yoga for kids": "Yes, we offer special yoga classes for children aged 5-12, focusing on fun, flexibility, and mindfulness.",
  "Do you offer workshops or events": "Yes, we regularly host workshops, retreats, and special events. Check our website or newsletter for upcoming events.",
  "Can I attend classes at different times": "The studio is open every day of the week, with classes offered at various times. Please check the full schedule on our website.",
  "Where is the studio located": "The studio is located at [Your Address], easily accessible by public transport and car.",
  "What services do you offer": "We offer group and private yoga classes, online classes, children's yoga, workshops, retreats, and special events."
}
